In [191]:
#1Create a Datatime index containing all the weekdays days of year 2019 and assign a 
#random number to each of them in a dataframe. 
import pandas as pd
import numpy as np
from pandas.tseries.offsets import *
pd.date_range('2019-11-01', '2019-11-08', freq=BDay())

DatetimeIndex(['2019-11-01', '2019-11-04', '2019-11-05', '2019-11-06',
               '2019-11-07', '2019-11-08'],
              dtype='datetime64[ns]', freq='B')

In [192]:
pd.bdate_range('2019-11-01', '2019-11-08')

DatetimeIndex(['2019-11-01', '2019-11-04', '2019-11-05', '2019-11-06',
               '2019-11-07', '2019-11-08'],
              dtype='datetime64[ns]', freq='B')

In [193]:
#2. Given Pandas series , height = [23,42,55] and weight = [71,32,48] . 
#Create a dataframe with height and weight as column names. 
import pandas as pd
data = {'height':[23,42,55], 'weight':[71,32,55]}
print(pd.DataFrame(data))

   height  weight
0      23      71
1      42      32
2      55      55

In [194]:
#3.How to get the items of series A not present in series B .From ser1 remove items present in ser2.
ser1 = pd.Series([2, 3, 4, 5])
ser2 = pd.Series([5, 6, 7, 8])
ser3 = list(set(ser1) - set(ser2))
ser3

[2, 3, 4]

In [195]:
ser4 = ser1[~ser1.isin(ser2)] 
ser4

0    2
1    3
2    4
dtype: int64

In [196]:
df_tt = pd.read_csv('titanic.csv') #or can give the full path name
df_tt.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [197]:
#Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset
df_tt.describe().Age

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [198]:
#How to get frequency counts of unique items of a series? 
#Calculate the frequency counts of ‘SibSp’ column in titanic Dataset
df_tt['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [199]:
#Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’
#column of titanic dataset
df_tt['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [200]:
df_tt.loc[df_tt.Embarked == 'Q', 'Embarked'] = 'Other'
df_tt['Embarked'].value_counts()

S        644
C        168
Other     77
Name: Embarked, dtype: int64

In [201]:
#Bin the price column in titanic data set into 5 equal groups and get counts of each bin
df_tt['Fare'].describe()
df_tt['Price_bin'] = pd.cut(df_tt['Fare'], [0, 125, 250, 375, 500, 625],
                           labels =['0-125', '125-250', '250-375', '375-500', '500-625'])
df_tt['Price_bin'].value_counts()

0-125      838
125-250     29
250-375      6
500-625      3
375-500      0
Name: Price_bin, dtype: int64

In [202]:
# Count the number of missing values in each column?
df_tt.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Price_bin       15
dtype: int64

In [203]:
#Get the row number of the 5th largest value in the Age column of titanic dataset?
df_tt.nlargest(5,'Age')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Price_bin
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S,0-125
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S,0-125
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,0-125
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,0-125
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Other,0-125

In [204]:
df_tt.loc[df_tt['Age'].idxmax()]

PassengerId                                     631
Survived                                          1
Pclass                                            1
Name           Barkworth, Mr. Algernon Henry Wilson
Sex                                            male
Age                                              80
SibSp                                             0
Parch                                             0
Ticket                                        27042
Fare                                             30
Cabin                                           A23
Embarked                                          S
Price_bin                                     0-125
Name: 630, dtype: object

In [205]:
#normalize Survived Passengers
print(df_tt['Survived'].value_counts())
print(df_tt['Survived'].value_counts(normalize = True))

0    549
1    342
Name: Survived, dtype: int64
0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [206]:
#normalize males that survived
print(df_tt['Survived'][df_tt['Sex']=='male'].value_counts())
print(df_tt['Survived'][df_tt['Sex']=='male'].value_counts(normalize=True))

0    468
1    109
Name: Survived, dtype: int64
0    0.811092
1    0.188908
Name: Survived, dtype: float64

In [207]:
#normalize females that survived
print(df_tt['Survived'][df_tt['Sex']=='female'].value_counts())
print(df_tt['Survived'][df_tt['Sex']=='female'].value_counts(normalize=True))

1    233
0     81
Name: Survived, dtype: int64
1    0.742038
0    0.257962
Name: Survived, dtype: float64

In [208]:
#normalize Age 
df_tt['Child'] = float()

In [209]:
#Normalize child
print(df_tt['Survived'][df_tt['Age'] < 18][df_tt['Sex']=='male'].value_counts())
print(df_tt['Survived'][df_tt['Age'] < 18][df_tt['Sex']=='male'].value_counts(normalize=True))

0    35
1    23
Name: Survived, dtype: int64
0    0.603448
1    0.396552
Name: Survived, dtype: float64

In [210]:
# Normalize Age 
print(df_tt['Survived'][df_tt['Age'] > 18].value_counts())
print(df_tt['Survived'][df_tt['Age'] > 18].value_counts(normalize=True))

0    355
1    220
Name: Survived, dtype: int64
0    0.617391
1    0.382609
Name: Survived, dtype: float64

In [211]:
#11. Get the indices of items of ser2 in ser1 as a list.
ser1=pd.Series([10,9,6,5,3,1,12,8,13])
ser2=pd.Series([1,3,10,13])
ser3=np.setdiff1d(ser1, ser2, assume_unique= False)
print(ser3)

[ 5  6  8  9 12]

In [212]:
#12. How to convert a series of date-strings to a timeseries?
dt=['01 Jan 2010','02-02-2011','20120303','2014/04/04','2015-06-06T12:20']
print(dt)
dt1=pd.to_datetime(pd.Series(dt))
print(dt1)

['01 Jan 2010', '02-02-2011', '20120303', '2014/04/04', '2015-06-06T12:20']
0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2014-04-04 00:00:00
4   2015-06-06 12:20:00
dtype: datetime64[ns]

In [213]:
#13. Get the day of month, week number, day of year and day of week from ser.
#ser=pd.Series(['01 Jan 2010','02-02-2011','20120303','2014/04/04','2015-06-06T12:20'])
#print('series: \n',ser)
#create the index:
#idx=['Day1','Day2','Day3','Day4','Day5']
#print('\n idx as: \n',idx)
#ser.index = idx
#ser=pd.to_datetime(ser)
df=pd.DataFrame({'dates':['01 Jan 2010','02-02-2011','20120303','2014/04/04','2015-06-06T12:20']})
df['dates'] = pd.to_datetime(df['dates'])
                             
df['dow1']=df['dates'].dt.weekday_name
df['dow2']=df['dates'].dt.dayofweek
df['dom']=df['dates'].dt.day
df['doy']=df['dates'].dt.dayofyear
df['wkn']=df['dates'].dt.week

print(df)

                dates       dow1  dow2  dom  doy  wkn
0 2010-01-01 00:00:00     Friday     4    1    1   53
1 2011-02-02 00:00:00  Wednesday     2    2   33    5
2 2012-03-03 00:00:00   Saturday     5    3   63    9
3 2014-04-04 00:00:00     Friday     4    4   94   14
4 2015-06-06 12:20:00   Saturday     5    6  157   23

In [214]:
#14. Compute the euclidean distance between series (points) p and q, 
#without using a packaged formula.
p=pd.Series([1,2,3,4,5,6,7,8,9,10])
q=pd.Series([10,9,8,7,6,5,4,3,2,1])
#print('p:',p)
#print('q:',q)
def distance(v1, v2):
    return np.sqrt(np.sum((v1 - v2) ** 2))  
print(distance(p,q))

18.16590212458495

In [215]:
#15. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)
#weeksmask = 'Mon Tue Wed Thu Fri'
#fr=('W-SUN','W-SAT')
s=pd.date_range('2000-01-01', periods=70, freq='D').to_series()
s1=s[s.dt.dayofweek > 4]
print(s1)
#print(len(s1))

2000-01-01   2000-01-01
2000-01-02   2000-01-02
2000-01-08   2000-01-08
2000-01-09   2000-01-09
2000-01-15   2000-01-15
2000-01-16   2000-01-16
2000-01-22   2000-01-22
2000-01-23   2000-01-23
2000-01-29   2000-01-29
2000-01-30   2000-01-30
2000-02-05   2000-02-05
2000-02-06   2000-02-06
2000-02-12   2000-02-12
2000-02-13   2000-02-13
2000-02-19   2000-02-19
2000-02-20   2000-02-20
2000-02-26   2000-02-26
2000-02-27   2000-02-27
2000-03-04   2000-03-04
2000-03-05   2000-03-05
dtype: datetime64[ns]

In [216]:
#16. Import every 50th row of BostonHousing dataset as a dataframe.
df_tt = pd.read_csv('titanic.csv')
df_tt.head()
df_tt_3_1 = df_tt.iloc[::2, :]
df_tt_3_1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S

In [217]:
df_tt_3 = df_tt[df_tt.index % 50 == 0] 
df_tt_3.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S
100,101,0,3,"Petranec, Miss. Matilda",female,28.0,0,0,349245,7.8958,NaN,S
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S
200,201,0,3,"Vande Walle, Mr. Nestor Cyriel",male,28.0,0,0,345770,9.5000,NaN,S